{"class_name": "Model", "config": {"name": "hinton model", "layers": [{"name": "Localist_Concept_Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "Localist_Concept_Input"}, "inbound_nodes": []}, {"name": "Localist_Relation_Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "Localist_Relation_Input"}, "inbound_nodes": []}, {"name": "Primary_Concept_Embedding_Layer", "class_name": "Embedding", "config": {"name": "Primary_Concept_Embedding_Layer", "trainable": false, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 13, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["Localist_Concept_Input", 0, 0, {}]]]}, {"name": "Secondary_Concept_Embedding_Layer", "class_name": "Embedding", "config": {"name": "Secondary_Concept_Embedding_Layer", "trainable": false, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 13, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["Localist_Relation_Input", 0, 0, {}]]]}, {"name": "Primary_Embedding_Dimensionality_Reduction", "class_name": "Flatten", "config": {"name": "Primary_Embedding_Dimensionality_Reduction", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["Primary_Concept_Embedding_Layer", 0, 0, {}]]]}, {"name": "Secondary_Embedding_Dimensionality_Reduction", "class_name": "Flatten", "config": {"name": "Secondary_Embedding_Dimensionality_Reduction", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["Secondary_Concept_Embedding_Layer", 0, 0, {}]]]}, {"name": "Internal_Distributed_Concept_Representation", "class_name": "Dense", "config": {"name": "Internal_Distributed_Concept_Representation", "trainable": true, "batch_input_shape": [null, 200], "dtype": "float32", "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Primary_Embedding_Dimensionality_Reduction", 0, 0, {}]]]}, {"name": "Internal_Distributed_Relation_Representation", "class_name": "Dense", "config": {"name": "Internal_Distributed_Relation_Representation", "trainable": true, "batch_input_shape": [null, 200], "dtype": "float32", "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Secondary_Embedding_Dimensionality_Reduction", 0, 0, {}]]]}, {"name": "Internal_Distributed_Proposition_Representation_Input", "class_name": "Concatenate", "config": {"name": "Internal_Distributed_Proposition_Representation_Input", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["Internal_Distributed_Concept_Representation", 0, 0, {}], ["Internal_Distributed_Relation_Representation", 0, 0, {}]]]}, {"name": "Dropout_Layer_1", "class_name": "Dropout", "config": {"name": "Dropout_Layer_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Internal_Distributed_Proposition_Representation_Input", 0, 0, {}]]]}, {"name": "Internal_Distributed_Proposition_Representation", "class_name": "Dense", "config": {"name": "Internal_Distributed_Proposition_Representation", "trainable": true, "batch_input_shape": [null, 400], "dtype": "float32", "units": 200, "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Dropout_Layer_1", 0, 0, {}]]]}, {"name": "Batch_Norm_Layer_1", "class_name": "BatchNormalization", "config": {"name": "Batch_Norm_Layer_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Internal_Distributed_Proposition_Representation", 0, 0, {}]]]}, {"name": "Dropout_Layer_2", "class_name": "Dropout", "config": {"name": "Dropout_Layer_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Batch_Norm_Layer_1", 0, 0, {}]]]}, {"name": "Internal_Distributed_Output_Representation", "class_name": "Dense", "config": {"name": "Internal_Distributed_Output_Representation", "trainable": true, "batch_input_shape": [null, 200], "dtype": "float32", "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Dropout_Layer_2", 0, 0, {}]]]}, {"name": "Batch_Norm_Layer_2", "class_name": "BatchNormalization", "config": {"name": "Batch_Norm_Layer_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Internal_Distributed_Output_Representation", 0, 0, {}]]]}, {"name": "Localist_Output_Representation", "class_name": "Dense", "config": {"name": "Localist_Output_Representation", "trainable": true, "dtype": "float32", "units": 13, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Batch_Norm_Layer_2", 0, 0, {}]]]}], "input_layers": [["Localist_Concept_Input", 0, 0], ["Localist_Relation_Input", 0, 0]], "output_layers": [["Localist_Output_Representation", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}